app/views/bookings/_index.html.erb

  <tbody>
    <% @table.bookings.each do |booking| next if booking.id.nil? %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."table_id" = ?  [["table_id", 1]]