app/controllers/bookings_controller.rb

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @table = Table.find(params[:table_id])
    @booking = @table.bookings.build(booking_params)

    if @booking.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("date", "duration", "user", "table_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2019-02-24 19:00:00"], ["duration", 60], ["user", "S"], ["table_id", 1], ["created_at", "2019-02-24 14:14:50.861443"], ["updated_at", "2019-02-24 14:14:50.861443"]]

    def set_booking
      @restaurant = Restaurant.find(params[:restaurant_id])
      @table = Table.find(params[:table_id])
      @booking = @table.bookings.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."table_id" = ? AND "bookings"."id" = ? LIMIT ?  [["table_id", 1], ["id", 1], ["LIMIT", 1]]