app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("title", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Bingo"], ["start", "2000-01-01 09:00:00"], ["end", "2000-01-01 23:00:00"], ["created_at", "2019-02-24 13:30:07.009715"], ["updated_at", "2019-02-24 13:30:07.009715"]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]