app/controllers/tables_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tables" ("restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["restaurant_id", 1], ["created_at", "2019-02-24 14:22:37.129371"], ["updated_at", "2019-02-24 14:22:37.129371"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @table = @restaurant.tables.build(table_params)

    if @table.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tables".* FROM "tables" WHERE "tables"."restaurant_id" = ? AND "tables"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_table
      @restaurant = Restaurant.find(params[:restaurant_id])
      @table = @restaurant.tables.find(params[:id])