app/models/booking.rb

SELECT "bookings".* FROM "bookings"
---
  def unique_booking
  	exiting_date = []

  	Booking.all.each do |booking|